<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>
Borrowed code and concepts from munkitools3.munki.recipe in the AutoPKG core recipes.
</string>
    <key>Identifier</key>
    <string>com.github.Gibbun.download.munki_rebrand</string>
    <key>Input</key>
    <dict>
        <key>MUNKIMASTERDOWNLOAD_URL</key>
        <string>https://github.com/munki/munki/archive/master.zip</string>
        <key>DOWNLOAD_URL</key>
        <string>https://munki.eps.uillinois.edu/Portal/MTM.onboard.pkg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.0</string>
    <key>Process</key>
    <array>
        <dict>
	    <key>Comment</key>
	    <string>Download clone of Munki code.</string>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%MUNKIMASTERDOWNLOAD_URL%</string>
                <key>download_dir</key>
                <string>%RECIPE_CACHE_DIR%/downloads</string>
		<key>Comment</key>
	    	<string>Icon must be in icns format</string>
                <key>ICON_DIR</key>
                <string>%RECIPE_CACHE_DIR%</string>
            </dict>
        </dict>
        <dict>
	    <key>Comment</key>
	    <string>Download MTM onboarding package to cache repack folder.</string>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>download_dir</key>
                <string>%RECIPE_CACHE_DIR%/downloads</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%RECIPE_CACHE_DIR%/downloads/*master*</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%found_filename%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%ICON_DIR%/*.icns</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/munki-master/code/apps/Managed Software Center/Managed Software Center/Managed Software Center.icns</string>
                <key>source_path</key>
                <string>%found_filename%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/munki-master/code/apps/Managed Software Center/Managed Software Center/MSC.icns</string>
                <key>source_path</key>
                <string>%found_filename%</string>
            </dict>
        </dict>	
    </array>
</dict>
</plist>
