<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>
Borrowed code and concepts from munkitools3.munki.recipe in the AutoPKG core recipes.
</string>
    <key>Identifier</key>
    <string>com.github.Gibbun.pkg.UofI_MTM_Installer</string>
    <key>Input</key>
    <dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.0</string>
    <key>ParentRecipe</key>
    <string>com.github.Gibbun.download.UofI_MTM_Installer</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>asset_regex</key>
                <string>^munkitools-3.*?pkg$</string>
                <key>github_repo</key>
                <string>munki/munki</string>
                <key>include_prereleases</key>
                <string>%INCLUDE_PRERELEASES%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
