<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>
Borrowed code and concepts from munkitools3.munki.recipe in the AutoPKG core recipes.
</string>
    <key>Identifier</key>
    <string>com.github.Gibbun.pkg.UofI_MTM_Installer</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>UofI_MTM_Installer</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.0</string>
    <key>ParentRecipe</key>
    <string>com.github.Gibbun.download.UofI_MTM_Installer</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Processor</key>
			<string>com.github.Gibbun.recipes/PkgDistributionCreator</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/</string>
				<key>destination_file</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.mpkg</string>
				<key>distribution_file</key>
				<string>%RECIPE_CACHE_DIR%/Resources/distribution.xml</string>
				<key>resources_path</key>
				<string>%RECIPE_CACHE_DIR%/Resources</string>
			</dict>
			<key>SharedProcessorRepoURL</key>
			<string>https://github.com/Gibbun/recipes</string>
		</dict>
    </array>
</dict>
</plist>
