<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>
Borrowed code and concepts from munkitools3.munki.recipe in the AutoPKG core recipes.
</string>
    <key>Identifier</key>
    <string>com.github.Gibbun.pkg.UofI_MTM_Installer</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>UofI_MTM_Installer</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.0</string>
    <key>ParentRecipe</key>
    <string>com.github.Gibbun.download.UofI_MTM_Installer</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Processor</key>
			<string>com.github.Gibbun.recipes.MTM_Installer/PkgDistributionCreator</string>
			<key>Arguments</key>
			<dict>
				<key>source_file1</key>
				<string>%RECIPE_CACHE_DIR%/repack/munkitools_core.pkg</string>
				<key>source_file2</key>
				<string>%RECIPE_CACHE_DIR%/repack/munkitools_admin.pkg</string>
				<key>source_file3</key>
				<string>%RECIPE_CACHE_DIR%/repack/munkitools_app.pkg</string>
				<key>source_file4</key>
				<string>%RECIPE_CACHE_DIR%/repack/munkitools_app_usage.pkg</string>
				<key>source_file5</key>
				<string>%RECIPE_CACHE_DIR%/repack/munkitools_launchd.pkg</string>
				<key>source_file6</key>
				<string>%RECIPE_CACHE_DIR%/repack/munkionboard.pkg</string>
				<key>distribution_file</key>
				<string>%RECIPE_CACHE_DIR%/distribution.xml</string>
				<key>package_dir</key>
				<string>%RECIPE_CACHE_DIR%/repack/</string>
				<key>output_file</key>
				<string>%NAME%.pkg</string>
			</dict>
			<key>SharedProcessorRepoURL</key>
			<string>https://github.com/Gibbun/recipes</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/Build</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>UofI_MTM_Installer*</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileMover</string>
            <key>Arguments</key>
            <dict>
                <key>source</key>
                <string>%found_filename%</string>
                <key>target</key>
                <string>%RECIPE_CACHE_DIR%/Build/%found_filename%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
